# 17. Задать список из N элементов, заполненных числами из [-N, N]. 
# Найти произведение элементов на указанных позициях. 
# Позиции хранятся в файле  file.txt в одной строке одно число

N = int(input('Введите любое число: '))
print(f'[{-N}, {N}]')

x = int(input('Введите первое число: '))
y = int(input('Введите второе число: '))
print(x*y)
