# 3. Вывести на экран числа от -N до N

num = int(input('Введите любое целое положительное число: '))
res = -num
while res <= num:
    print (res)
    res += 1